# Brewfile - Declarative package management for macOS
# Usage: brew bundle --file=~/Code/dotfiles/Brewfile

# Taps
tap "homebrew/bundle"
tap "oven-sh/bun"

# =============================================================================
# CLI Tools
# =============================================================================

brew "git"
brew "neovim"
brew "tmux"
brew "starship"
brew "chezmoi"

# Modern CLI replacements
brew "ripgrep"      # grep replacement
brew "fd"           # find replacement
brew "fzf"          # fuzzy finder
brew "zoxide"       # cd replacement
brew "eza"          # ls replacement
brew "bat"          # cat replacement
brew "lazygit"      # git TUI

# ZSH plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Markdown
brew "glow"         # Terminal markdown renderer
brew "grip"         # GitHub-style markdown preview

# =============================================================================
# Development
# =============================================================================

brew "node"
brew "oven-sh/bun/bun"
brew "go"
brew "python"

# =============================================================================
# Cloud & Infrastructure
# =============================================================================

cask "google-cloud-sdk"

# =============================================================================
# Security & Secrets
# =============================================================================

cask "1password"
cask "1password-cli"

# =============================================================================
# AI Tools
# =============================================================================

brew "gemini-cli"       # Google Gemini CLI
cask "claude-code"      # Anthropic Claude Code CLI

# =============================================================================
# Applications
# =============================================================================

cask "arc"              # Arc browser
cask "ghostty"
cask "raycast"

# =============================================================================
# Fonts
# =============================================================================

cask "font-jetbrains-mono-nerd-font"
